---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationPart..::..SplitStraight Method
FabricationPart Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SplitStraight(XYZ) | Splits the straight into two at the passed in point. |
|  | SplitStraight(Document, ElementId, XYZ) | Splits the straight into two at the passed in point. |

# See Also

FabricationPart Class

FabricationPart Members

Autodesk.Revit.DB Namespace